#include <iostream>


int main() {
    std::cout << "\nВариант задания "  << (22 + 1) % 4 + 1 << ":\n\tЛинейный список" <<std::endl;
    std::cout << "\nВариант процедуры "  << (22 + 1) - int((22 + 1)  / 6) * 6 << ":\n\t"
                                                               "Cлияниедвух стеков, деков, списков или очередей, упорядоченных по возрастанию, с сохранением порядка\n\n"
                                                               "Метод:\n\tCортировка слянием"<< std::endl;
    return 0;
}


